y_connector/y-piece_r0.75mm_bg5mlpmin_in10mlpmin_o4cm_bg1cm_p4cm_refined/system/meshQualityDict
// included in snappyHexMeshDict

/*
 * As advised here, when having trouble with adding layers,
 * it may be helpful to disable these quality controls
 * to manually inspect an invalid mesh in paraFoam to isolate the problem:
 * https://www.cfd-online.com/Forums/openfoam-meshing/106388-troubles-layer-adding-my-mesh.html#post379309
 */

// Documentation of the following variables: https://www.openfoam.com/documentation/guides/latest/doc/guide-meshing-snappyhexmesh-meshquality.html

// "Maximum face non-orthogonality angle [deg]: the angle made by the vector between the two adjacent cell centres across the common face and the face normal"
maxNonOrtho 65;  // 65, disabled: 180

maxBoundarySkewness 20;  // 20, disabled: -1

// "Maximum internal face skewness"
maxInternalSkewness 4;  // 4, disabled: -1

// "Maximum cell concavity [deg]"
maxConcave 80;  // 80, disabled: 180

// "Minimum cell pyramid volume [m³]"
minVol 1e-33;  // 1e-13, disabled: 1e-33

// "Minimum tetrahedron quality"
//  1e-15 (small positive) to enable tracking
// -1e+30 (large negative) for best layer insertion
minTetQuality 1e-15;

// "if >0 : preserve single cells with all points on the surface if the
// resulting volume after snapping (by approximation) is larger than
// minVolCollapseRatio times old volume (i.e. not collapsed to flat cell).
//  If <0 : delete always."
//minVolCollapseRatio 0.5; // commented out in documentation…

// "Minimum face area [m 2]: A negative value to bypass this metric"
minArea -1;

minTwist 0.02;

// "Minimum cell determinant"
minDeterminant 0.001;

// "Minimum face interpolation weight"
minFaceWeight 0.05;

// "Optional"
minFaceFlatness -1;

minVolRatio 0.01;

minTriangleTwist -1;

// nSmoothScale and errorReduction defined in snappyHexMeshDict!
